from django.test import TestCase

from main.utils import split_text


class GoogleUtilsTests(TestCase):
    def test_google_split_text(self):
        test_cases = [
            ("チームVolareですね僕達は出かけるeducationでテック学習ですねすごいものは英語の学習アプリを消すねただの英語の学習アプリじゃなくて自分の普段の会話から勝手にできる英語学習アプリですで駄目になったら薬をやっていざ日常と喋れないことがあると思うんですけどなんで喋れないかって言うとあの広大な辞書に載ってる家で自分が普段使ってる言葉とちょっと思うんですよねってことはあのアプリを作って自分が普段こうやってベラベラ喋ってるなよ全部取っといてそこから英語の住所とかを生成することで自分が普段喋ってる言葉を最低限それをそれさえ子にできれば普段でも喋れるわけですからね何もわからないとかちょっとできるとかそういうことを一緒になってないような子でもできるそういうことかが進化した今のテクノロジーを使えばできるというそういうアプリ",
             [
                 'チームVolareですね', '僕達は出かけるeducationでテック学習ですね',
                 'すごいものは英語の学習アプリを消すね', 'ただの英語の学習アプリじゃなくて',
                 '自分の普段の会話から勝手にできる英語学習アプリですで', '駄目になったら', '薬をやって',
                 'いざ日常と喋れないことがあると思うんですけど', 'なんで喋れないかって言うと',
                 'あの広大な辞書に載ってる家で自分が普段使ってる言葉とちょっと思うんですよねって', 'ことはあのアプリを作って',
                 '自分が普段こうやって', 'ベラベラ喋ってるなよ全部取っといて',
                 'そこから英語の住所とかを生成することで自分が普段喋ってる言葉を最低限それをそれさえ子にできれば普段でも喋れるわけですからね',
                 '何もわからないとかちょっとできるとかそういうことを一緒になってない', 'ような子でもできるそういうことかが',
                 '進化した今のテクノロジーを使えばできるというそういうアプリ'
             ]),
            ("スペースがあるじゃないですかやって絶対あるスペースでわかってかつ一番最後にあの同士が来るって言うも翼くん同士じゃないか一番最後に何が来る一番最初に何が来ると決まってるので次々出るんですよ",
             [
                 'スペースがあるじゃないですかやって', '絶対あるスペースでわかって',
                 'かつ一番最後にあの同士が来るって言うも翼くん同士じゃないか',
                 '一番最後に何が来る一番最初に何が来ると決まってるので次々出るんですよ'
             ]),
            ("誰がその中の問題も悪化したら問題モードに移行して日本語出てきて英語単語帳みたいな感じでセンスみたいな感じで帰ってペラペラペラオみたいな感じで",
             [
                 '誰がその中の問題も悪化したら', '問題モードに移行して', '日本語出てきて',
                 '英語単語帳みたいな感じでセンスみたいな感じで帰って', 'ペラペラペラオみたいな感じで'
             ]),
             ("ファブをこいつの真ん中に LINE してるってのやりました漫画になってるよね待って待って　さっき家に帰りました",
             [
                 'ファブをこいつの真ん中にLINEしてるってのやりました',
                 '漫画になってるよね待って待って',
                 'さっき家に帰りました'
             ]),
            #  ("英語の学習アプリですねただの英語の学習アプリじゃなくて自分の普段の会話から勝手にできる英語学習アプリです",
            # [
            #     '英語の学習アプリですね','ただの英語の学習アプリじゃなくて自分の普段の会話から勝手にできる英語学習アプリです'
            # ])
        ]
        for test_case in test_cases:
            texts = split_text(test_case[0])
            print(texts)
            try:
                self.assertTrue(test_case[1] == texts)
            except AssertionError as e:
                try:
                    for i in range(len(texts)):
                        print(f"実際: {texts[i]}\n正解: {test_case[1][i]}")
                        print("-" * 24)
                except Exception:
                    pass
                raise e
            print("OK")
